let chapterData = [
    {
        "bookName" : "physics",
        "bookNum" : 1,
        "chapter" : [
            "ভৌত রাশি ও পরিমাপ",
            "গতি",
            "বল",
            "কাজ ক্ষমতা ও শক্তি",
            "পদার্থের অবস্থা ও চাপ",
            "বস্তুর ওপর তাপের প্রভাব",
            "তরঙ্গ ও শব্দ",
            "আলোর প্রতিফলন",
            "আলোর প্রতিসরণ",
            "স্থির বিদ্যুৎ",
            "চল বিদ্যুৎ",
            "বিদ্যুতের চৌম্বক ক্রিয়া",
            "আধুনিক পদার্থবিজ্ঞান ও ইলেক্ট্রনিকস",
            "জীবন বাঁচাতে পদার্থবিজ্ঞান",
            "সম্পূর্ণ বই",
        ]
    },
    {
        "bookName" : "Chemistry",
        "bookNum" : 2,
        "chapter" : [
            "রসায়নের ধারণা",
            "পদার্থের অবস্থা",
            "পদার্থের গঠন",
            "পর্যায় সারণি",
            "মোলের ধারণা ও রাসায়নিক গণনা",
            "রাসায়নিক বিক্রিয়া",
            "রসায়ন ও শক্তি",
            "এসিড ক্ষারক সমতা",
            "খণিজ সম্পদঃ ধাতু ও অধাতু",
            "খণিজ সম্পদঃ জীবাশ্ম",
            "আমাদের জীবনে রসায়ন",
            "রাসায়নিক বন্ধন",
            "রাসায়নিক বন্ধন",
        ]
    },
    {
        "bookName" : "General Math",
        "bookNum" : 3,
        "chapter" : [
            "বাস্তব সংখ্যা",
            "সেট ও ফাংশন",
            "বীজগাণিতিক রাশি",
            "সূচক ও লগারিদম",
            "এক চলকবিশিষ্ট সমীকরণ",
            "রেখা কোণ ও ত্রিভুজ",
            "ব্যবহারিক জ্যামিতি",
            "বৃত্ত",
            "ত্রিকোণমিতিক অনুপাত",
            "দূরত্ব ও উচ্চতা",
            "বীজগাণিতিক অনুপাত ও সমানুপাত",
            "দুই চলকবিশিষ্ট সরল সহসমীকরণ",
            "সসীম ধারা",
            "অনুপাত, সদৃশতা ও প্রতিসমতা",
            "ক্ষেত্রফল সম্পর্কিত উপপাদ্য ও সম্পাদ্য",
            "পরিমিতি",
            "পরিসংখ্যান"
        ]
    }
]