// ALLERT!!! Dont delete it chapterdata it helps the run add mcq perfectly

let chapterData = [
    [
        {
            "bookName" : "পদার্থবিজ্ঞান",
            "bookNum" : 1,
            "chapter" : [
                "ভৌত রাশি ও পরিমাপ",
                "গতি",
                "বল",
                "কাজ ক্ষমতা ও শক্তি",
                "পদার্থের অবস্থা ও চাপ",
                "বস্তুর ওপর তাপের প্রভাব",
                "তরঙ্গ ও শব্দ",
                "আলোর প্রতিফলন",
                "আলোর প্রতিসরণ",
                "স্থির বিদ্যুৎ",
                "চল বিদ্যুৎ",
                "বিদ্যুতের চৌম্বক ক্রিয়া",
                "আধুনিক পদার্থবিজ্ঞান ও ইলেক্ট্রনিকস",
                "জীবন বাঁচাতে পদার্থবিজ্ঞান",
                "সম্পূর্ণ বই",
            ]
        },
        {
            "bookName" : "রসায়ন",
            "bookNum" : 2,
            "chapter" : [
                "রসায়নের ধারণা",
                "পদার্থের অবস্থা",
                "পদার্থের গঠন",
                "পর্যায় সারণি",
                "রাসায়নিক বন্ধন",
                "মোলের ধারণা ও রাসায়নিক গণনা",
                "রাসায়নিক বিক্রিয়া",
                "রসায়ন ও শক্তি",
                "এসিড ক্ষারক সমতা",
                "খণিজ সম্পদঃ ধাতু ও অধাতু",
                "খণিজ সম্পদঃ জীবাশ্ম",
                "আমাদের জীবনে রসায়ন"
            ]
        },
        {
            "bookName" : "সাধারণ গণিত",
            "bookNum" : 3,
            "chapter" : [
                "বাস্তব সংখ্যা",
                "সেট ও ফাংশন",
                "বীজগাণিতিক রাশি",
                "সূচক ও লগারিদম",
                "এক চলকবিশিষ্ট সমীকরণ",
                "রেখা কোণ ও ত্রিভুজ",
                "ব্যবহারিক জ্যামিতি",
                "বৃত্ত",
                "ত্রিকোণমিতিক অনুপাত",
                "দূরত্ব ও উচ্চতা",
                "বীজগাণিতিক অনুপাত ও সমানুপাত",
                "দুই চলকবিশিষ্ট সরল সহসমীকরণ",
                "সসীম ধারা",
                "অনুপাত, সদৃশতা ও প্রতিসমতা",
                "ক্ষেত্রফল সম্পর্কিত উপপাদ্য ও সম্পাদ্য",
                "পরিমিতি",
                "পরিসংখ্যান"
            ]
        }
    ]
];

// after add mcq everything dynamic

let SiteStaticData = [
    {
        'departMent' : "বিজ্ঞান বিভাগ",
        'data' : [
            {
                "bookName" : "পদার্থবিজ্ঞান",
                "chapter" : [
                    "ভৌত রাশি ও পরিমাপ",
                    "গতি",
                    "বল",
                    "কাজ ক্ষমতা ও শক্তি",
                    "পদার্থের অবস্থা ও চাপ",
                    "বস্তুর ওপর তাপের প্রভাব",
                    "তরঙ্গ ও শব্দ",
                    "আলোর প্রতিফলন",
                    "আলোর প্রতিসরণ",
                    "স্থির বিদ্যুৎ",
                    "চল বিদ্যুৎ",
                    "বিদ্যুতের চৌম্বক ক্রিয়া",
                    "আধুনিক পদার্থবিজ্ঞান ও ইলেক্ট্রনিকস",
                    "জীবন বাঁচাতে পদার্থবিজ্ঞান",
                    "সম্পূর্ণ বই",
                ]
            },
            {
                "bookName" : "রসায়ন",
                "bookNum" : 2,
                "chapter" : [
                    "রসায়নের ধারণা",
                    "পদার্থের অবস্থা",
                    "পদার্থের গঠন",
                    "পর্যায় সারণি",
                    "রাসায়নিক বন্ধন",
                    "মোলের ধারণা ও রাসায়নিক গণনা",
                    "রাসায়নিক বিক্রিয়া",
                    "রসায়ন ও শক্তি",
                    "এসিড ক্ষারক সমতা",
                    "খণিজ সম্পদঃ ধাতু ও অধাতু",
                    "খণিজ সম্পদঃ জীবাশ্ম",
                    "আমাদের জীবনে রসায়ন",
                    "সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "সাধারণ গণিত",
                "bookNum" : 3,
                "chapter" : [
                    "বাস্তব সংখ্যা",
                    "সেট ও ফাংশন",
                    "বীজগাণিতিক রাশি",
                    "সূচক ও লগারিদম",
                    "এক চলকবিশিষ্ট সমীকরণ",
                    "রেখা কোণ ও ত্রিভুজ",
                    "ব্যবহারিক জ্যামিতি",
                    "বৃত্ত",
                    "ত্রিকোণমিতিক অনুপাত",
                    "দূরত্ব ও উচ্চতা",
                    "বীজগাণিতিক অনুপাত ও সমানুপাত",
                    "দুই চলকবিশিষ্ট সরল সহসমীকরণ",
                    "সসীম ধারা",
                    "অনুপাত, সদৃশতা ও প্রতিসমতা",
                    "ক্ষেত্রফল সম্পর্কিত উপপাদ্য ও সম্পাদ্য",
                    "পরিমিতি",
                    "পরিসংখ্যান",
                    "সম্পূর্ণ বই"
                ]
            }
        ]
    },
    {
        'departMent' : "মানবিক বিভাগ",
        'data' : [
            {
                "bookName" : "ইতিহাস",
                "bookNum" : 1,
                "chapter" : [
                    "ইতিহাস manobik chapter 1",
                    "ইতিহাস manobik chapter 2",
                    "ইতিহাস manobik chapter 3",
                    "ইতিহাস manobik chapter 4",
                    "ইতিহাস সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "ভূগোল",
                "bookNum" : 2,
                "chapter" : [
                    "vugol manobik chapter 1",
                    "vugol manobik chapter 2",
                    "vugol manobik chapter 3",
                    "vugol manobik chapter 4",
                    "vugol সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "পাতিহাস",
                "bookNum" : 3,
                "chapter" : [
                    "পাতিহাস manobik chapter 1",
                    "পাতিহাস manobik chapter 2",
                    "পাতিহাস manobik chapter 3",
                    "পাতিহাস manobik chapter 4",
                    "পাতিহাস সম্পূর্ণ বই"
                ]
            }
        ]
    },
    {
        'departMent' : "ব্যবসায় শিক্ষা বিভাগ",
        'data' : [
            {
                "bookName" : "বাণিজ্য",
                "bookNum" : 1,
                "chapter" : [
                    "বাণিজ্য manobik chapter 1",
                    "বাণিজ্য manobik chapter 2",
                    "বাণিজ্য manobik chapter 3",
                    "বাণিজ্য manobik chapter 4",
                    "বাণিজ্য সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "ব্যাবসা",
                "bookNum" : 2,
                "chapter" : [
                    "ব্যাবসা manobik chapter 1",
                    "ব্যাবসা manobik chapter 2",
                    "ব্যাবসা manobik chapter 3",
                    "ব্যাবসা manobik chapter 4",
                    "ব্যাবসা সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "কমার্স",
                "bookNum" : 3,
                "chapter" : [
                    "কমার্স manobik chapter 1",
                    "কমার্স manobik chapter 2",
                    "কমার্স manobik chapter 3",
                    "কমার্স manobik chapter 4",
                    "কমার্স সম্পূর্ণ বই"
                ]
            }
        ]
    },
    {
        'departMent' : "কমন বুকস",
        'data' : [
            {
                "bookName" : "বাংলা",
                "bookNum" : 1,
                "chapter" : [
                    "বাংলা chapter 1",
                    "বাংলা chapter 2",
                    "বাংলা chapter 3",
                    "বাংলা chapter 4",
                    "বাংলা সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "ইংরেজি ১ম",
                "bookNum" : 2,
                "chapter" : [
                    "ইংরেজি ১ম chapter 1",
                    "ইংরেজি ১ম chapter 2",
                    "ইংরেজি ১ম chapter 3",
                    "ইংরেজি ১ম chapter 4",
                    "ইংরেজি ১ম সম্পূর্ণ বই"
                ]
            },
            {
                "bookName" : "ইংরেজি ২য়",
                "bookNum" : 3,
                "chapter" : [
                    "ইংরেজি ২য় chapter 1",
                    "ইংরেজি ২য় chapter 2",
                    "ইংরেজি ২য় chapter 3",
                    "ইংরেজি ২য় chapter 4",
                    "ইংরেজি ২য় সম্পূর্ণ বই"
                ]
            }
        ]
    }
];


let questionCategory = [
    "বোর্ড প্রশ্ন",
    "স্কুলের প্রশ্ন",
    "বাই অ্যাফোর্ড প্রশ্ন"
];
let boardName = [
    {
        "boardName" : "দিনাজপুর বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "ঢাকা বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "রাজশাহী বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "কুমিল্লা বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "যশোর বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "চট্টগ্রাম বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "সিলেট বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "বরিশাল বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "মাদ্রাসা বোর্ড", 
        "boardYear" : ['২০১৫','২০১৬','২০১৭','২০১৮','২০১৯','২০২০','২০২১','২০২২','২০২৩']
    },
    {
        "boardName" : "সকল বোর্ড", 
        "boardYear" : ["২০১৮"]
    }
];
// famous school name...
let famousSchoolName = [
    "ঠাকুরগাঁও বালক উচ্চ বিদ্যালয়",
    "বগুলাডাঙ্গি উচ্চ বিদ্যালয়",
    "বালিয়া স্কুল"
]